const num1 = 20        //შევქმენი მუდმივი ცვლადი num1
const num2 = 25       //შევქმენი მუდმივი ცვლადი num2
if (num1 > num2){                
    console.log("bad")            //ადარებს ორ რიცხვს ეთმანეთს და თუ num1 მეტია num2_ზე დაპრინტავს bad
}else if(num1 < num2){        
    console.log("good")          //ადარებს ორ რიცხვს ეთმანეთს და თუ num1 ნაკლებია num2_ზე დაპრინტავს good
}else{
    console.log("equal")        //ადარებს ორ რიცხვს ეთმანეთს და თუ num1 ტოლია num2_ის დაპრინტავს equal
}

let a = true    // შევქმენი ბულიან ტიპის ცვლადი
console.log(a)  //  დავპრინტე ბულიან ტიპის ცვლადი

let myAge = '29'                    //შევქმენი ცვლადი ჩემი ასაკი სტრინგ ტიპის მნიშვნელობით
let newMyAge = Number(myAge)       // ცვლადი მივანიჭე ნუმბერ ტიპის მნიშვნეობა
let oldMyAge = String(newMyAge)   // დავაბრუნე ისევ სტრინგ ტიპის მნიშვნეობა

console.log(typeof myAge)      // შევამოწმე და დავპრინტე ცვლადის ტიპი
console.log(typeof newMyAge)   //შევამოწმე და დავპრინტე ნუმბერ ტიპად გარდაქმნილი ცვლადის ტიპი
console.log(typeof oldMyAge)   //შევამოწმე და დავპრინტე სტრინგ ტიპად გარდაქმნილი ცვლადის ტიპი


console.log(2 === '2')     //აქ შევადარეთ მკაცრი ტოლობით
console.log(2 == '2')      // აქ შევადარეთ სხვადასხვა ტიპის მონაცემები 
console.log(2 + '2')      // ნუმბერ ტიპის მნიშვნელობას დავუმატე სტრინ ტიპის მნიშვნელობა

