# 1)
# შექმენით სია, ამ სიაში ჩაწერეთ სხვადასხვა ციფრები
# (1, 2, 3, 4, ასე არა, რამე მაგ: 45, 23, 87, 55,) და გამოიტანეთ ამ 
# სიაში ყველა რიცხვის ჯამი, ასევე ამავე სიიდან უნდა დაპრინტოთ ყველა 
# რიცხვი ცალ ცალკე, და მიუწეროთ ლუწია თუ კენტი.


list = [43, 56, 24, 7, 77, 95 ,32 ,54]
sum = sum(list)
print (sum)
for i in list:
    if i % 2 == 1:
        print (i, "odd")
    else:
        print(i, "even")


# 2)
# ბილეთი ღირს 25 ლარი,
# მაგრამ ბავშვებისთვის უფასოა,
# გვყავს 13 ადამიანი, აქედან 10 დიდი და 3 ბავშვი, 
# გამოთვალეთ ჯამში რამდენი ლარი დასჭირდებათ 
        
tiket_price = 25
i = 0
while i < 14:
    person = int(input("enter person age: "))
    if i > 8:
        tiket_price += 25
        print (tiket_price)
    i += 1


# 3)
# მომხმარებელს შემოატანინეთ სახელი,
# და დაპრინტეთ ეს სახელი იმდენჯერ, რამდენი ასოც არის სახელში.

name = input("enter your name: ")
for i in range(len(name)):
    print(i, name)


# 4)
# GOA ში ყოველ შემოყვანილ ადამიანზე გეძლევა 100ლ.
# მომხმარებელს შემოატანინეთ თუ რამდენი ადამიანი შემოიყვანა 
# ხოლო თითო შემოყვანილ ადამიანზე დაერიცხოს 100ლ

# 1) რამდენი დაგერიცხება თუ შემოიყვან 10 ბავშვს?  15 ბავშცს?

charge_you = 100
how_much = int(input("how much did you bring: "))
sum = (charge_you*how_much)
print (sum)

# 2) რამდენი დაგერიცხება თუ შემოიყვან 100 ბავშვს 
# გამოკლებული 37 დამატებული 13 გაყოფილი 10 და გამრავებული 264 ზე

child = 100
price = 100
print ((child - 37 + 13)/10 * 264, "gel")


# 5)
# HARDEST BOSS:
# დაპრინტეთ hello world (ოღონდ არა ასე print("hello world")  )

import sys
sys.stdout.write("hello world")